/* source.cpp
 Программа демонстрирует возможности класса Matrix */

#include <iostream>
#include "matrix.h"

using namespace std;

void main(){
	/*----------1------------
	Matrix a(2,4);
	double b=7;

	a[0][0]=1; a[1][0]=0;
	a[0][1]=4; a[1][1]=8;
	a[0][2]=2; a[1][2]=1;
	a[0][3]=7; a[1][3]=0;*/

	//-----------2------------
	Matrix a(2,4);
	Matrix b(4,3);

	a[0][0]=1; a[1][0]=0;
	a[0][1]=4; a[1][1]=8;
	a[0][2]=2; a[1][2]=1;
	a[0][3]=7; a[1][3]=0;

	b[0][0]=1; b[0][1]=5; b[0][2]=5;
	b[1][0]=3; b[1][1]=7; b[1][2]=0;
	b[2][0]=1; b[2][1]=8; b[2][2]=0;
	b[3][0]=1; b[3][1]=1; b[3][2]=0; 

	/*--------3--------
	Matrix a(2,4);
	Matrix b(2,4);

	a[0][0]=1; a[1][0]=7;
	a[0][1]=1; a[1][1]=8;
	a[0][2]=5; a[1][2]=1;
	a[0][3]=4; a[1][3]=1;

	b[0][0]=1; b[1][0]=0;
	b[0][1]=5; b[1][1]=8;
	b[0][2]=2; b[1][2]=1;
	b[0][3]=0; b[1][3]=1;*/

	
	cout<<a<<endl
		<<b<<endl
		<<a*b<<endl;
	/*
	Matrix a;
	Matrix b(2,2);
	Matrix c(3,3);

	for (int i = 0; i < 2; i++)
		for (int j = 0; j < 2; j++) b[i][j] = i+j;

	b *= 2;
	b = a = b + b; 

	if (a != b) cout << "Something wrong\n";
	else cout << "As expected\n";

	//b += c;   // эта строчка работать не должна, потому что матрицы
		  // разной размерности складывать нельзя.         

	cout << a << endl
	     << c << endl
	     << b << endl;*/

	return;}